# St7DeleteFactorsEnvelopeCase

Deletes the specified result case dependency for a factors envelope for the currently open solution.

long St7DeleteFactorsEnvelopeCase(long uID, long Envelope, long Pos)

Input Parameters

uID

Strand7 model file ID.

Envelope

Factors envelope number.

Pos

Factors envelope case number.